In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

df = pd.DataFrame(people)
df['last'] == 'Doe'

0    False
1     True
2     True
Name: last, dtype: bool

In [7]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [9]:
for index, row in df.iterrows():
    print(index,row)  #try row["last"]

0 first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object
1 first                 Jane
last                   Doe
email    JaneDoe@email.com
Name: 1, dtype: object
2 first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [4]:
filt = df['last']=='Doe'
df[filt]

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [5]:
df[df['last']=='Doe']

  first last              email
1  Jane  Doe  JaneDoe@email.com
2  John  Doe  JohnDoe@email.com

In [6]:
filt = df['email'] == 'CoreyMSchafer@gmail.com'
df.loc[filt,'first']

0    Corey
Name: first, dtype: object

In [7]:
# df.set_index('email',inplace=True)
# df.loc['CoreyMSchafer@gmail.com','first']

In [8]:
filt = (df['email'] == "CoreyMSchafer@gmail.com") | (df['first'] == 'Jane')
print(df[filt],'/n')
print(df.loc[filt,'last'])

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com /n
0    Schafer
1        Doe
Name: last, dtype: object

In [9]:
filt = (df['email'] == "CoreyMSchafer@gmail.com") | (df['first'] == 'Jane')
# print(df[~filt],'/n')    # ~ means whatever is not in filt
print(df.loc[~filt,'last'])

2    Doe
Name: last, dtype: object

In [10]:
df = pd.read_csv('csv_data/survey_results_public.csv',index_col='Respondent')  # instead of df.set_index('Respondent',inplace=True)
schema_df = pd.read_csv('csv_data/survey_results_schema.csv',index_col='Column')

pd.set_option("display.max_columns",60)
pd.set_option("display.max_columns",60)

In [11]:
schema_df.loc['ConvertedComp','QuestionText']

'Salary converted to annual USD salaries using the exchange rate on 2019-02-01, assuming 12 working months and 50 working weeks.'

In [12]:
high_salary = df['ConvertedComp'] >= 70000
df.loc[high_salary,['Country','LanguageWorkedWith','ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
Respondent,,,
6,Canada,Java;R;SQL,366420.0
9,New Zealand,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;P...,95179.0
13,United States,Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;...,90000.0
16,United Kingdom,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;T...,455352.0
22,United States,Bash/Shell/PowerShell;C++;HTML/CSS;JavaScript;...,103000.0
...,...,...,...
88876,United States,Bash/Shell/PowerShell;C#;HTML/CSS;Java;Python;...,180000.0
88877,United States,Bash/Shell/PowerShell;C;Clojure;HTML/CSS;Java;...,2000000.0
88878,United States,HTML/CSS;JavaScript;Scala;TypeScript,130000.0
88879,Finland,Bash/Shell/PowerShell;C++;Python,82488.0
88882,Netherlands,C#;HTML/CSS;Java;JavaScript;PHP;Python,588012.0

In [13]:
countries = ['United States','Spain','Germany','Brazil']
filt = df['Country'].isin(countries)
df.loc[filt,'Country'].head(150)

Respondent
4      United States
13     United States
14           Germany
19            Brazil
22     United States
           ...
431    United States
433    United States
434    United States
435    United States
436    United States
Name: Country, Length: 150, dtype: object

In [14]:
filt_combined = (df['ConvertedComp'] >= 70000) & df['Country'].isin(countries)
df.loc[filt_combined,['ConvertedComp','Country']].head(50)

            ConvertedComp        Country
Respondent
13                90000.0  United States
22               103000.0  United States
26               114000.0  United States
29               100000.0  United States
32              1100000.0  United States
35                80000.0  United States
39               156000.0  United States
44                87996.0        Germany
45               175000.0  United States
47               187000.0  United States
58              2000000.0  United States
60               107000.0  United States
66               137490.0        Germany
70                75000.0  United States
77               100000.0  United States
95               110000.0  United States
102             2000000.0  United States
106              160000.0  United States
108              140000.0  United States
110              100000.0  United States
116              103117.0          Spain
127              106000.0  United States
132               83200.0  United States
139               70000.0  United States
142              180000.0  United States
143               93951.0        Germany
148              135000.0  United States
155              962424.0        Germany
157              960000.0  United States
160              150000.0  United States
166             2000000.0  United States
173               77911.0        Germany
179               70000.0  United States
185              125000.0  United States
191               90000.0  United States
206              120000.0  United States
209              112800.0  United States
210              110000.0  United States
211              117800.0  United States
219              110000.0  United States
224              233000.0  United States
232              120000.0  United States
244               90000.0  United States
246               88000.0  United States
250               80738.0  United States
262              864000.0  United States
267              135000.0  United States
269              123000.0  United States
275              130000.0  United States
278              100000.0  United States

In [15]:
filt = df['LanguageWorkedWith'].str.contains("Python",na=False)   ## na=False does not include NaN values
df.loc[filt,'LanguageWorkedWith']
df[filt]['LanguageWorkedWith'].count()

36443

In [16]:
len(df[filt]['LanguageWorkedWith'])

36443